Ran Plan for dir: `deployment/dev/terraform` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/atlantis/bin/terraform1.7.0 plan -input=false -refresh -out \"/atlantis/repos/broadinstitute/backstage/1/default/deployment/dev/terraform/development-default.tfplan\"" in "/atlantis/repos/broadinstitute/backstage/1/default/deployment/dev/terraform": exit status 1
module.postgres.null_resource.module_depends_on: Refreshing state... [id=6215754838028235222]
module.db_service_accounts.google_service_account.service_accounts["backstage"]: Refreshing state... [id=projects/bits-backstage-dev/serviceAccounts/backstage@bits-backstage-dev.iam.gserviceaccount.com]
google_secret_manager_secret.backstage-bits-credentials["auth-google-client-secret"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/auth-google-client-secret]
google_secret_manager_secret.backstage-bits-credentials["github-app-backstage-bits-credentials"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/github-app-backstage-bits-credentials]
google_secret_manager_secret.backstage-bits-credentials["auth-github-client-secret"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/auth-github-client-secret]
google_secret_manager_secret.backstage-bits-credentials["auth-google-client-id"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/auth-google-client-id]
google_project_service.api_services["cloudidentity.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/cloudidentity.googleapis.com]
google_secret_manager_secret.backstage-bits-credentials["auth-github-client-id"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/auth-github-client-id]
google_project_service.api_services["secretmanager.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/secretmanager.googleapis.com]
data.google_project.current: Reading...
google_project_service.api_services["iam.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/iam.googleapis.com]
google_project_service.api_services["iap.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/iap.googleapis.com]
data.google_client_config.current: Reading...
google_project_iam_member.sa_access: Refreshing state... [id=bits-backstage-dev/roles/owner/group:devnull-sa@broadinstitute.org]
google_project_service.api_services["sts.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/sts.googleapis.com]
google_project_iam_member.team_access: Refreshing state... [id=bits-backstage-dev/roles/editor/group:devnull@broadinstitute.org]
data.google_client_config.current: Read complete after 0s [id=projects/"bits-backstage-dev"/regions/"us-east4"/zones/<null>]
google_project_service.api_services["compute.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/compute.googleapis.com]
google_storage_bucket.tech-docs: Refreshing state... [id=bits-backstage-dev-tech-docs]
google_project_service.api_services["monitoring.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/monitoring.googleapis.com]
google_project_service.api_services["sqladmin.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/sqladmin.googleapis.com]
data.google_project.current: Read complete after 1s [id=projects/bits-backstage-dev]
google_project_service.api_services["iamcredentials.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/iamcredentials.googleapis.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/cloudsql.client"]: Refreshing state... [id=bits-backstage-dev/roles/cloudsql.client/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=bits-backstage-dev/roles/iam.serviceAccountTokenCreator/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/monitoring.metricWriter"]: Refreshing state... [id=bits-backstage-dev/roles/monitoring.metricWriter/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/cloudsql.instanceUser"]: Refreshing state... [id=bits-backstage-dev/roles/cloudsql.instanceUser/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/monitoring.viewer"]: Refreshing state... [id=bits-backstage-dev/roles/monitoring.viewer/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/secretmanager.secretAccessor"]: Refreshing state... [id=bits-backstage-dev/roles/secretmanager.secretAccessor/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-gke-clusters-dev=>roles/container.viewer"]: Refreshing state... [id=bits-gke-clusters-dev/roles/container.viewer/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-gke-clusters-dev=>roles/container.clusterViewer"]: Refreshing state... [id=bits-gke-clusters-dev/roles/container.clusterViewer/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-gke-clusters=>roles/container.viewer"]: Refreshing state... [id=bits-gke-clusters/roles/container.viewer/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-gke-clusters=>roles/container.clusterViewer"]: Refreshing state... [id=bits-gke-clusters/roles/container.clusterViewer/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.postgres.data.google_compute_zones.available[0]: Reading...
module.postgres.data.google_compute_zones.available[0]: Read complete after 0s [id=projects/bits-backstage-dev/regions/us-east4]
module.postgres.google_sql_database_instance.default: Refreshing state... [id=backstage-dev]
google_service_account_iam_member.db_workload_identity: Refreshing state... [id=projects/bits-backstage-dev/serviceAccounts/backstage@bits-backstage-dev.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:bits-gke-clusters-dev.svc.id.goog[backstage/backstage]]
module.postgres.google_sql_database.default[0]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage]
module.postgres.random_password.user-password: Refreshing state... [id=none]
module.postgres.google_sql_database.additional_databases["backstage_plugin_scaffolder"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_scaffolder]
module.postgres.google_sql_database.additional_databases["backstage_plugin_catalog"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_catalog]
module.postgres.google_sql_database.additional_databases["backstage_plugin_search"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_search]
module.postgres.google_sql_database.additional_databases["backstage_plugin_auth"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_auth]
module.postgres.google_sql_database.additional_databases["backstage_plugin_app"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_app]
module.postgres.google_sql_user.iam_account["backstage"]: Refreshing state... [id=backstage@bits-backstage-dev.iam//backstage-dev]
module.postgres.google_sql_user.default[0]: Refreshing state... [id=backstage//backstage-dev]
postgresql_grant.table_permissions["backstage_plugin_catalog"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_catalog_public_table]
postgresql_grant.table_permissions["backstage_plugin_auth"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_auth_public_table]
postgresql_grant.schema_usage_create["backstage"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_public_schema]
postgresql_grant.table_permissions["backstage"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_public_table]
postgresql_grant.table_permissions["backstage_plugin_app"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_app_public_table]
postgresql_grant.table_permissions["backstage_plugin_scaffolder"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_scaffolder_public_table]
postgresql_grant.table_permissions["backstage_plugin_search"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_search_public_table]
postgresql_grant.schema_usage_create["backstage_plugin_auth"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_auth_public_schema]
postgresql_grant.schema_usage_create["backstage_plugin_app"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_app_public_schema]
postgresql_grant.schema_usage_create["backstage_plugin_catalog"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_catalog_public_schema]
postgresql_grant.schema_usage_create["backstage_plugin_scaffolder"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_scaffolder_public_schema]
postgresql_grant.database_connect["backstage_plugin_app"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_app_database]
postgresql_grant.schema_usage_create["backstage_plugin_search"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_search_public_schema]
postgresql_grant.database_connect["backstage"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_database]
postgresql_grant.database_connect["backstage_plugin_catalog"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_catalog_database]
postgresql_grant.database_connect["backstage_plugin_auth"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_auth_database]
postgresql_grant.database_connect["backstage_plugin_scaffolder"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_scaffolder_database]
postgresql_grant.database_connect["backstage_plugin_search"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_search_database]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # google_storage_bucket.tech-docs must be replaced
-/+ resource "google_storage_bucket" "tech-docs" {
      - default_event_based_hold    = false -> null
      ~ effective_labels            = {} -> (known after apply)
      - enable_object_retention     = false -> null
      ~ id                          = "bits-backstage-dev-tech-docs" -> (known after apply)
      - labels                      = {} -> null
      ~ name                        = "bits-backstage-dev-tech-docs" -> "bits-backstage-dev-techdocs" # forces replacement
      ~ public_access_prevention    = "inherited" -> (known after apply)
      - requester_pays              = false -> null
      ~ rpo                         = "DEFAULT" -> (known after apply)
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/bits-backstage-dev-tech-docs" -> (known after apply)
      ~ terraform_labels            = {} -> (known after apply)
      ~ url                         = "gs://bits-backstage-dev-tech-docs" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ lifecycle_rule {
          - condition {
              - age                        = 365 -> null
              - days_since_custom_time     = 0 -> null
              - days_since_noncurrent_time = 0 -> null
              - matches_prefix             = [] -> null
              - matches_storage_class      = [] -> null
              - matches_suffix             = [] -> null
              - no_age                     = false -> null
              - num_newer_versions         = 1 -> null
              - with_state                 = "ANY" -> null
            }
          + condition {
              + age                   = 365
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + num_newer_versions    = 1
              + with_state            = (known after apply)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
╷
│ Error: Instance cannot be destroyed
│ 
│   on main.tf line 38:
│   38: resource "google_storage_bucket" "tech-docs" {
│ 
│ Resource google_storage_bucket.tech-docs has lifecycle.prevent_destroy set,
│ but the plan calls for this resource to be destroyed. To avoid this error
│ and continue with the plan, either disable lifecycle.prevent_destroy or
│ reduce the scope of the plan using the -target option.
╵


```
</details>